# Welcome to Production Report
author: Jack Lau <br>
last edit: 13/10/19 <br>
purpose: this report is use to show the production and grade info for the intopia

In [1]:
import pandas as pd
from intopia_analysis import *

In [2]:
df_contact = pd.read_csv('Intopia - Contact List - Sheet1.csv')
df_production = get_production_data('phase2/period4/')

## Total Production by grade and type

In [3]:
df_production.groupby(['Grade','type']).sum()

0           Company  Unit Production
Grade type
0     x        1164         7805.000
      y         446          898.259
1     x         107         1365.000
      y         138          705.000

## Total Production by grade, type, region

In [4]:
df_production.groupby(['Grade','type', 'region']).sum()

0                  Company  Unit Production
Grade type region
0     x    cc          307         1940.000
           ec          535         3744.000
           wc          322         2121.000
      y    cc           96          230.000
           ec          180          293.259
           wc          170          375.000
1     x    ec           12          300.000
           wc           95         1065.000
      y    cc           33          100.000
           ec           12          140.000
           wc           93          465.000

# Production Tracking

In [10]:
df_team_production = production_tracking(df_contact, df_production, 'y', 1) #<-- change the x and y, and grade 
df_team_production

     Company  Grade  Unit Production type region
66        12    1.0            140.0    y     ec
67        12    1.0            155.0    y     wc
142       25    1.0            235.0    y     wc
182       33    1.0            100.0    y     cc
328       56    1.0             75.0    y     wc

In [12]:
###Team Tracker
team_tracker(df_contact, 25)

     Team Number     Team Member Main Contact Email Facebook
110           25  Otoo, Michelle          NaN   NaN      NaN
111           25      Han, Livia          NaN   NaN      NaN
112           25  Burrage, Perri          NaN   NaN      NaN
113           25   Fazzari, Ryan          NaN   NaN      NaN
114           25   Masters, Reid          NaN   NaN      NaN